In [1]:
import pandas as pd

### Percentual

In [3]:
dados = {
    'emprego': ['Administrador de BD', 'Desenvolvedor', 'Arquiteto de redes'],
    'florida': [77140, 71540, 62310],
    'nova_jersey': [97350, 82080, 112840]
}

dataset = pd.DataFrame(dados)
dataset

               emprego  florida  nova_jersey
0  Administrador de BD    77140        97350
1        Desenvolvedor    71540        82080
2   Arquiteto de redes    62310       112840

In [6]:
dataset['%nova_jersey'] = (dataset['nova_jersey'] / dataset['nova_jersey'].sum()) * 100
dataset['%_florida'] = (dataset['florida'] / dataset['florida'].sum()) * 100
dataset

               emprego  florida  nova_jersey  %nova_jersey  %_florida
0  Administrador de BD    77140        97350     33.308242  36.560974
1        Desenvolvedor    71540        82080     28.083621  33.906820
2   Arquiteto de redes    62310       112840     38.608136  29.532205

### Coeficientes e taxas

In [7]:
dados = {
   'ano': ['1', '2', '3', '4', 'total'], 
   'matriculas_marco': [70, 50, 47, 23, 190], 
   'matriculas_novembro': [65, 48, 40, 22, 175], 
}

dataset = pd.DataFrame(dados)
dataset

     ano  matriculas_marco  matriculas_novembro
0      1                70                   65
1      2                50                   48
2      3                47                   40
3      4                23                   22
4  total               190                  175

In [9]:
# Coeficiente de evasão = número de alunos evadidos / número inicial de matriculas
dataset['coeficiente_evasao'] = (dataset['matriculas_marco'] - dataset['matriculas_novembro']) / dataset['matriculas_marco']

# Taxa de evasão = coenficiente de evasão * 100
dataset['taxa_evasao'] = dataset['coeficiente_evasao'] * 100

dataset
# Podemos concluir, por exemplo, que o ano 3 obteve a maior taxa de evasão (a cada 100 alunos matriculados, 14.89 alunos evadem)

,ano,matriculas_marco,matriculas_novembro,coeficiente_evasao,taxa_evasao
0,1,70,65,0.071429,7.142857
1,2,50,48,0.040000,4.000000
2,3,47,40,0.148936,14.893617
3,4,23,22,0.043478,4.347826
4,total,190,175,0.078947,7.894737